# Brew

tap 'CrunchyData/brew'
tap 'stripe/stripe-cli'

brew 'cb'
brew 'fd' # Required by nvim
brew 'flyctl'
brew 'gemini-cli'
brew 'gh'
brew 'git'
brew 'glow'
brew 'imagemagick'
brew 'libyaml' # Ruby needs this to build
brew 'mise'
brew 'mjml'
brew 'neovim'
brew 'opencode'
brew 'p7zip'
brew 'pnpm'
brew 'postgresql@15', restart_service: true
brew 'ripgrep'
brew 'rlwrap'
brew 'starship'
brew 'stripe/stripe-cli/stripe'
brew 'stow'
brew 'tailscale'
brew 'tmux'
brew 'tree-sitter-cli'
brew 'zsh-completions'
brew 'zsh'

# Cask
cask 'cleanshot'
cask 'claude'
cask 'dropbox'
cask 'elgato-camera-hub'
cask 'firefox'
cask 'font-meslo-lg-nerd-font'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'hyperkey'
cask 'kitty'
cask 'linear-linear'
cask 'obsidian'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'superhuman'
cask 'tailscale-app'
cask 'telegram'
cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'
