# Brew
brew 'gh'
brew 'git'
brew 'mise'
brew 'pnpm'
brew 'postgresql@15', restart_service: true
brew 'starship'
brew 'zsh-completions'
brew 'zsh'

# Cask
cask 'cleanshot'
cask 'claude'
cask 'claude-code'
cask 'elgato-camera-hub'
cask 'firefox'
cask 'google-chrome'
cask 'linear-linear'
cask 'obsidian'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'superhuman'
cask 'telegram'
cask 'tuple'
cask 'visual-studio-code'
cask 'windsurf'
cask 'zoom'
